In [4]:
import pandas as pd

In [6]:
!pip install cx_Oracle

Collecting cx_Oracle
  Using cached cx_Oracle-8.3.0-cp39-cp39-win_amd64.whl (213 kB)
Installing collected packages: cx-Oracle
Successfully installed cx-Oracle-8.3.0

In [8]:
import cx_Oracle as ora

In [11]:
dsn = ora.makedsn('localhost',1521,service_name='orcl')
conn = ora.connect(user='scott',password='tiger',dsn =dsn,encoding='utf-8')

In [17]:
emp=pd.read_sql('select * from emp',conn,index_col='EMPNO')

C:\Users\admin\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [18]:
emp

        ENAME        JOB     MGR   HIREDATE     SAL    COMM  DEPTNO
EMPNO
7369    SMITH      CLERK  7902.0 1980-12-17   800.0     NaN      20
7499    ALLEN   SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
7521     WARD   SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
7566    JONES    MANAGER  7839.0 1981-04-02  2975.0     NaN      20
7654   MARTIN   SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30
7698    BLAKE    MANAGER  7839.0 1981-05-01  2850.0     NaN      30
7782    CLARK    MANAGER  7839.0 1981-06-09  2450.0     NaN      10
7839     KING  PRESIDENT     NaN 1981-11-17  5000.0     NaN      10
7844   TURNER   SALESMAN  7698.0 1981-09-08  1500.0     0.0      30
7900    JAMES      CLERK  7698.0 1981-12-03   950.0     NaN      30
7902     FORD    ANALYST  7566.0 1981-12-03  3000.0     NaN      20
7934   MILLER      CLERK  7782.0 1982-01-23  1300.0     NaN      10

In [19]:
conn.close()

In [20]:
import sqlalchemy

In [23]:
engine=sqlalchemy.create_engine('oracle://scott:tiger@localhost:1521/orcl',encoding='utf-8')

In [24]:
engine

Engine(oracle://scott:***@localhost:1521/orcl)

In [25]:
conn =engine.connect()

In [26]:
pd.read_sql('select * from emp',conn)

    empno   ename        job     mgr   hiredate     sal    comm  deptno
0    7369   SMITH      CLERK  7902.0 1980-12-17   800.0     NaN      20
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975.0     NaN      20
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850.0     NaN      30
6    7782   CLARK    MANAGER  7839.0 1981-06-09  2450.0     NaN      10
7    7839    KING  PRESIDENT     NaN 1981-11-17  5000.0     NaN      10
8    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500.0     0.0      30
9    7900   JAMES      CLERK  7698.0 1981-12-03   950.0     NaN      30
10   7902    FORD    ANALYST  7566.0 1981-12-03  3000.0     NaN      20
11   7934  MILLER      CLERK  7782.0 1982-01-23  1300.0     NaN      10

In [27]:
import seaborn as sns

In [28]:
tips=sns.load_dataset('tips')

In [33]:
tips.to_sql('tips',engine,index=False,if_exists='fail')

ValueError: Table 'tips' already exists.